[{
		"blog_": "Ultimate Travel Guide To Nairobi, Kenya",
		"blog_category": "travel tips",
		"blog_image": "https://hips.hearstapps.com/elleuk.cdnds.net/18/10/2048x1333/gallery-1520275648-gettyimages-585000875.jpg?resize=768:*",
		"blog_title": "Think Kenya, and you think safari, right? Or perhaps, less favourably, you're familiar with the capital's other name: 'Nairobbery'. But dismiss both stereotypes and you'll quickly fall in love by East Africas most cosmopolitan city. Nairobi is the youngest, the most modern, and the fastest growing place in Africa. Its Kenyas beating heart, a giant melting pot of locals, tourists and expats simply trying to find their way round this hectic but oh-so exciting concrete jungle. From the simple to the sublime, accommodation in Nairobi has pretty much got you covered. If you want to wake up amid the hustle and bustle, aim for the city centre. Between Tom Mboya St and River Rd, you'll find lots of small hotels and guesthouses. For something a little more peaceful, the dusitD2 Nairobi is worth checking out. A five-star hotel, it's nestled amongst the leafy suburb of 14 Riverside Drive. Six months after a fateful terrorist attack forced the resort to shut its door, they're now back - and doing better than ever.",
		"blog_author": "Meshack",
		"blog_date": "May 23 2022",
		"blog_comments": "16"
	},
	{
		"blog_": "Wedding and honeymoons",
		"blog_category": "weddings and honeymoons",
		"blog_image": "https://www.ticketsasa.com/images/images.php?src=components/com_enmasse/upload/images/dinner_sirville_elementiata_lodge_season_special_cba.jpg&w=785&h=465&zc=1&q=100",
		"blog_title": "Your journey to the perfect wedding celebration – a gathering distinguished by exotic surroundings, inspiring architecture and design, world-class cuisine and the undivided attention of experienced wedding coordinators – begins at Serena Hotels. Our collection of 5-star hotels encompasses some of the most unique settings in the world, with gorgeous locations throughout Africa and Asia. Whether you’re searching for the perfect tropical beach wedding location along the Swahili coastline, a garden oasis in the heart of Kabul or a romantic lodge in the shadow of Mount Kilimanjaro, we can help you select the ideal destination and custom tailor your wedding exactly to your vision.",
		"blog_author": "Elly",
		"blog_date": "April 10 2022",
		"blog_comments": "4"
	},
	{
		"blog_": "Wellness spa",
		"blog_category": "wellness",
		"blog_image": "https://www.sarovahotels.com/whitesands-mombasa/assets/images/product/49/spa-thumb_spa.jpg",
		"blog_title": "brings you a taste of Asia to the heart of the city with its new Pan-Asian themed Restaurant- Herbs & Spices (H&S). Savor expertly crafted cuisine influenced by Pan-Asian culture that takes you on a culinary journey through South East Asia.  H&S has a contemporary setup with a flair of coziness’ to its ambience with the interiors featuring natural color palettes and rustic wooden finish. The restaurant offers both indoor and outdoor seating options giving diners an opportunity to enjoy a casual lunch or something a little more intimate any time of the day. Inspired by a fusion of traditional composition of flavors from Japanese, Chinese, Taiwanese and Koren cuisine features on the menu offering diners a selection of both vegetarian and non-vegetarian dishes that appeal to their palates. Poised on the terrace of H&S, is the trendy bar serving a concise menu of classic drinks as well as innovatively prepared cocktails by our expert mixologist. The cocktails feature bold yet refreshing herbs and spices to create magic in your glass that you will not find anywhere else in Nairobi . Excellent service and the hospitality will ensure your gastronomic experience at H&S is unforgettable.",
		"blog_author": "Abel",
		"blog_date": "May 23 2022",
		"blog_comments": "11"
	},
 	{
		"blog_": "Yoga and aerobics",
		"blog_category": "general care tips",
		"blog_image": "https://www.sarovahotels.com/panafric-nairobi/assets/images/product/fitness-center-gallery-thumb5_fitness-centre_5.jpg",
		"blog_title": "The large gym space is bright, airy and invigorating to the senses, with wonderful pool & garden views below. Pops of pale wood and ambient lighting instantly give off a luxurious high-tech feel. Positive affirmations are strategically placed for that extra dose of motivation. Featuring the latest in fitness innovation, we guarantee you a superb experience and great results whether your choice is Yoga and Pilates or High-intensity training. Our Sauna and Steam rooms provide therapeutic post-work-out recovery and are just as ideal if you want to feel rejuvenated. The resting areas are designed to promote relaxation and a soothing of the senses. Our wellness specialists are on hand at all times to attend to you.",
		"blog_author": "Robin",
		"blog_date": "June 16 2022",
		"blog_comments": "1"
	},
 	{
		"blog_": "Friendly football watch",
		"blog_category": "activities",
		"blog_image": "https://www.westonhotel.com/wp-content/uploads/2020/03/1L2A4561-750x330.jpg",
		"blog_title": "The Hotel held its 2nd Corporate Social Responsibility at Nairobi West Prisons on Friday 28th February 2020. The Weston FC team won the friendly football match with NW Prisons FC by 2 goals to 1 and thereafter shared a drink and mingled with the team and the loyal fans who graced the event.",
		"blog_author": "Situ",
		"blog_date": "May 2 2022",
		"blog_comments": "0"
	},
 	{
		"blog_": "best places to fill your Instagram stories with breathtaking pics",
		"blog_category": "photo gallery",
		"blog_image": "https://www.maasaimarakenyapark.com/wp-content/uploads/2019/08/Nairobi-National-Park-700x450.jpg",
		"blog_title": "Located just 10 minutes from the Nairobi National park, Weston hotel gives you an oppoturnity to take those Instagrammable pics of the wildlife set on the background of the Nairobi skyline. From the towering giraffes to lions, the natural glaze of the park will fill your likes-craving heart with satisfaction. In additoin to that, the Weston hotel rooftop terrace has a stunning view of the city. ",
		"blog_author": "Kibet",
		"blog_date": "May 30 2022",
		"blog_comments": "2"
	}
]
