[{
		"blog_": "How to maximize on your resort stay",
		"blog_category": "travel tips",
		"blog_image": "https://www.ticketsasa.com/images/images.php?src=components/com_enmasse/upload/images/thepool_sunset_sirville_elementaita_lodge_season_special_cba.jpg",
		"blog_title": "No place is 100% secure. That's why we advice our guests to wear a zipped trouser or sweater so as to keep portable devices safe while exporing the city. When entering a new pace, ensure you have done research, and let someone you know have your location. Hell, you can even share your location using apps like Google Maps.",
		"blog_author": "Meshack",
		"blog_date": "May 23 2022",
		"blog_comments": "16"
	},
	{
		"blog_": "Outside catering services",
		"blog_category": "restaurant",
		"blog_image": "https://www.ticketsasa.com/images/images.php?src=components/com_enmasse/upload/images/dinner_sirville_elementiata_lodge_season_special_cba.jpg&w=785&h=465&zc=1&q=100",
		"blog_title": "Our seasoned chefs, event managers and banqueting team are specially trained to meet all your needs. We cater from as few as 25 pax to as many as 1,000 pax for events in Nairobi and beyond. To ensure a smooth event, pre site visits are carried out with the client and meetings held to ensure the guest need is meet. Managerial supervision is one of our key strengths during such events.",
		"blog_author": "Elly",
		"blog_date": "April 10 2022",
		"blog_comments": "4"
	},
	{
		"blog_": "Weston Spa",
		"blog_category": "resort",
		"blog_image": "https://www.westonhotel.com/wp-content/uploads/2019/09/SPA.jpg",
		"blog_title": "Our lifestyle and wellness hub is more than a spa. If you simply need to relax and rejuvenate from the hustle and bustle of life, air massages, facials, body scrubs, aromatherapy, reflexology, manicure and pedicure treatments are perfect for you. Our tailor-made detox menus & juices, health check-ups and wellness programs contribute to your overall health as a human being. We go beyond the norm for our clients by offering weekly menu planning for any health conditions and wellness doctor check-ups.",
		"blog_author": "Abel",
		"blog_date": "May 23 2022",
		"blog_comments": "11"
	},
 	{
		"blog_": "Yoga and aerobics",
		"blog_category": "general care tips",
		"blog_image": "https://www.westonhotel.com/wp-content/uploads/2019/09/AEROBI4.png",
		"blog_title": "If pumping weights and exercise machines are not your speed, separate from the main gymnasium is a studio for yoga and aerobics classes, led by enthusiastic and experienced instructors. The aerobic studio offers class and workout sessions in: cardiovascular, kick-boxing, dance, salsa, step aerobics, ‘Aero-tone’, ‘Astanga Vinyasa’ and ‘Hatha’ yoga, spinning, ‘Tai chi’ and ‘body stretch and sculpture’.",
		"blog_author": "Robin",
		"blog_date": "June 16 2022",
		"blog_comments": "1"
	},
 	{
		"blog_": "Friendly football watch",
		"blog_category": "activities",
		"blog_image": "https://www.westonhotel.com/wp-content/uploads/2020/03/1L2A4561-750x330.jpg",
		"blog_title": "The Weston Hotel held its 2nd Corporate Social Responsibility at Nairobi West Prisons on Friday 28th February 2020. The Weston FC team won the friendly football match with NW Prisons FC by 2 goals to 1 and thereafter shared a drink and mingled with the team and the loyal fans who graced the event.",
		"blog_author": "Situ",
		"blog_date": "May 2 2022",
		"blog_comments": "0"
	},
 	{
		"blog_": "best places to fill your Instagram stories with breathtaking pics",
		"blog_category": "photo gallery",
		"blog_image": "https://www.maasaimarakenyapark.com/wp-content/uploads/2019/08/Nairobi-National-Park-700x450.jpg",
		"blog_title": "Located just 10 minutes from the Nairobi National park, Weston hotel gives you an oppoturnity to take those Instagrammable pics of the wildlife set on the background of the Nairobi skyline. From the towering giraffes to lions, the natural glaze of the park will fill your likes-craving heart with satisfaction. In additoin to that, the Weston hotel rooftop terrace has a stunning view of the city. ",
		"blog_author": "Kibet",
		"blog_date": "May 30 2022",
		"blog_comments": "2"
	}
]
